# LAB 1

## Цели работы

Разработать программу, которая вводит с клавиатуры два или три типа данных, и в качестве результата выводит в файл функцию, в которой будут созданы и проинициализированы переменные указанных типов, а также осуществлены арифметические операции над этими переменными с последующим выводом результата.

## Выполнение

В ходе работы программа получает на вход набор типов переменных, начальные значения переменных, а также типы операций над переменными. В результате создаётся файл, который содержит функцию "f" выполняющую введённые операции.

К примеру были введены следующие типы переменных (int, uint), начальные значения (2, -15), а также типы операций (+, -, /).

В результате получилась следующая функция:

```c
void f() {
    int var1{ 2 };
    unsigned int var2{ -15 };

    std::cout << "var1(" << var1 << ") + var2(" << var2 << ") = " << var1 + var2 << "\n";
    std::cout << "var1(" << var1 << ") - var2(" << var2 << ") = " << var1 - var2 << "\n";
    std::cout << "var1(" << var1 << ") / var2(" << var2 << ") = " << var1 / var2 << "\n";
}
```

## Выводы по работе

В ходе выполнения работы, были разработана программа на языке C++, изучены принципы работы с операциями ввода/вывода на языке C++. 